#!/usr/bin/env bash

# ----------------------------------------------------------------------------------------------------
# ⏹变量BASH_SOURCE返回一个数组，内容是当前的脚本调用堆栈。
# 该数组的0号成员是当前执行的脚本
# 1号成员是调用当前脚本的脚本
# 以此类推，跟变量FUNCNAME是一一对应关系。
# ----------------------------------------------------------------------------------------------------

cd 12-脚本除错 || exit 1

# 使用 source 命令 将 04-lib1.sh 和 04-lib2.sh 的脚本引入到此脚本中
# shellcheck disable=SC1091
source 04-lib1.sh
# shellcheck disable=SC1091
source 04-lib2.sh

# ⏹04-环境变量_BASH_SOURCE.sh脚本 中 调用 func1函数
# ⏹func1函数来源于 04-lib1.sh 脚本中，func1 函数内部又调用了 04-lib2.sh 脚本中的 func2 函数
func1

# 👉关于 BASH_SOURCE 的用法，请参照04-lib1.sh 和 04-lib2.sh👈