#!/usr/bin/env bash

# 环境变量是 Bash 环境自带的变量，进入 Shell 时已经定义好了，可以直接使用。

# ⏹显示环境变量的2种方式
env
printenv
echo '/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/'

# ⏹查看单个环境变量的值
# printenv命令后面的变量名，不用加前缀$
printenv HOME  # /home/apluser
echo "$HOME"  # /home/apluser
echo '/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/'

# 定义一个变量
myvar="hello world"
echo "$myvar"
# 定义一个函数
myfunc() {
    echo "myfunc函数执行了..."
}

# set命令可以显示所有变量（包括环境变量和自定义变量），以及所有的 Bash 函数。
set | grep 'myvar'
set | grep 'myfunc'


