#!/usr/bin/env bash

# ------------------------------------------------------------
# ⏹${varname:-word}
# 如果变量 varname 存在且不为空，则返回它的值
# 否则返回word
# ------------------------------------------------------------
var1='var1的实际内容'
echo "${var1:-var1的默认值}"  # var1的实际内容
echo "${var11:-var11的默认值}"  # var11的默认值
# $var11是不存在的变量，因此不会有值被打印到控制台上
echo "$var11"
echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/\e[0m"

# ------------------------------------------------------------
# ⏹${varname:=word}
# 如果变量varname存在且不为空，则返回它的值
# 否则将它设为word，并且返回word。
# ------------------------------------------------------------
var2='var2的实际内容'
echo "${var2:=var2的默认值}"  # var2的实际内容
echo "${var22:=var22的默认值}"  # var22的默认值
# 为变量设置了默认值
echo "$var22"  # var22的默认值
echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/\e[0m"

# ------------------------------------------------------------
# ⏹${varname:+word}
# 如果变量名存在且不为空，则返回word，否则返回空值。
# 测试变量是否存在
# 比如 ${count:+1} 表示变量count存在时返回1（表示true），否则返回空值。
# ------------------------------------------------------------
var3='var3的实际内容'
if [ "${var3:+exists}" ]; then
    echo "变量的值实际存在，变量值为: ${var3}"  # 变量的值实际存在，变量值为: var3的实际内容
else
    echo "变量并不存在..."
fi

# 删除变量 var3
# 以下这两种方式都算删除了变量 var3

# unset var3
var3=''

if [ "${var3:+exists}" ]; then
    echo "变量的值实际存在，变量值为: ${var3}"
else
    echo "变量并不存在..."  # 变量并不存在...
fi
echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/\e[0m"

# ------------------------------------------------------------
# ⏹${varname:?message}
# 如果变量varname存在且不为空，则返回它的值，否则打印出varname: message，并中断脚本的执行。
# 如果省略了message，则输出默认的信息“parameter null or not set.”。
# 该语法的目的是防止变量未定义就执行，如果变量未定义就执行的话，会给出提示信息。
# ------------------------------------------------------------
get_user_info() {

    # 检查函数的第一个参数是否存在
    local param1="${1:?必须要传递一个参数!!!}"

    echo "传递的第一个参数值为: ${param1}"
}

# 调用写好的函数，并传递参数，函数正常结束
get_user_info user_file.csv
# 未传递参数调用写好的函数，函数报错，并提示信息
get_user_info

echo -e "\e[1;32m===========================整个脚本执行结束===========================\e[0m"