#!/usr/bin/env bash

var1='Hello World'
var2='Hello World'
var3='你好 世界'

# --------------------------------------------------------------------------------
# ⏹Bash 可以使用 [[ ]] 进行字符串的比较
# --------------------------------------------------------------------------------

# 🔴[[ $string1 == $string2 ]] 判断字符串相等
if [[ "${var1}" == "${var2}" ]]; then
    echo "1. 字符串相等"
fi

# 🔴[[ $string1 != $string2 ]] 判断字符串不相等
if [[ "${var1}" != "${var3}" ]]; then
    echo "2. 字符串不相等"
fi

# 🔴[[ -z $string ]] 判断字符串为空
var4=''
if [[ -z "${var4}" ]]; then
    echo "3.1 字符串为空或字符串不存在"
fi
# varC 这个变量压根就没有被定义
if [[ -z "${varC}" ]]; then
    echo "3.2 字符串为空或字符串不存在"
fi

# 🔴判断字符串不为空
if [[ -n "${var1}" ]]; then
    echo "4. 字符串不为空"
fi
