#!/usr/bin/env bash

# ---------------------------------------------------------------------------------------------------
# ⏹expr命令
# 👉这个命令已经过时了，不建议使用👈
# 👉建议使用 ((...)) 来替代👈
# ---------------------------------------------------------------------------------------------------

# 🔴支持算术运算，不支持非整数运算
# shellcheck disable=SC2003
var1=$(expr 3 + 2)
echo "运算结果是: ${var1}"

# 🔴支持变量替换
var2=10
echo "运算结果是: $(expr $var2 + 10)"

# ---------------------------------------------------------------------------------------------------
# ⏹let命令
# 👉这个命令已经过时了，不建议使用👈
# 👉建议使用 ((...)) 来替代👈
# ---------------------------------------------------------------------------------------------------

# 🔴用于将算术运算的结果，赋予一个变量。
# shellcheck disable=SC2219
let var3=10+20
echo "运算结果是: $var3"  # 运算结果是: 30

# 🔴如果中间有空格的话，需要使用双引号括起来
# shellcheck disable=SC2219
let "var4 = 968 + 252"
echo "运算结果是: $var4"  # 算结果是: 1220