#!/usr/bin/env bash

echo -n "输入一个1到3之间的数字 > "
read -r character

# ---------------------------------------------------------------------------------------------------
# ⏹if结构的判断条件，一般使用test命令，有三种形式
# 1. test expression
# 2. [ expression ]
# 3. [[ expression ]]
#
# 💥注意点
# 1. [[ expression ]] 支持正则表达式，而 test expression 和 [ expression ] 不支持正则
# 2. [ expression ] 和 [[ expression ]] 之间必须要有空格
# ---------------------------------------------------------------------------------------------------
if [ "$character" = "1" ]; then
    echo 1
elif test "$character" = "2"; then
    echo 2
elif [[ "$character" = "3" ]]; then
    echo 3
else
    echo 输入不符合要求...
fi

# ⏹判断文件是否存在
# ---------------------------------------
# 方式1
# ---------------------------------------
if test -e ./README.md; then
    echo '1. 文件存在'
fi

# ---------------------------------------
# 方式2
# ---------------------------------------
if [ -e ./README.md ]; then
    echo '2. 文件存在'
fi

# ---------------------------------------
# 方式3
# ---------------------------------------
if [[ -e ./README.md ]]; then
    echo '3. 文件存在'
fi