#!/usr/bin/env bash

# ---------------------------------------------------------------------------------------------------
# ⏹shift 命令
# shift命令可以改变脚本参数，
# 每次执行都会移除脚本当前的第一个参数（$1），
# 使得后面的参数向前一位，
# 即$2变成$1、$3变成$2、$4变成$3，以此类推。
# ---------------------------------------------------------------------------------------------------

get_param1() {

    echo "一共输入了 $# 个参数"

    while [ "$1" != "" ]; do

        echo "剩下 $# 个参数"
        echo "当前参数为：$1"

        # 每循环一次，就移除一个参数
        shift
    done
}

get_param1 param1 param2 param3

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

get_param2() {

    echo "一共输入了 $# 个参数"  # 一共输入了 5 个参数
    for param in "$@"; do
        echo "$param"
        # 参数1
        # 参数2
        # 参数3
        # 参数4
        # 参数5
    done

    echo "========================"
    # 使用 shift 命令移除前两个参数
    shift 2
    echo "========================"

    echo "一共输入了 $# 个参数"  # 一共输入了 3 个参数
    for param in "$@"; do
        echo "$param"
        # 参数3
        # 参数4
        # 参数5
    done
}

get_param2 参数1 参数2 参数3 参数4 参数5