#!/usr/bin/env bash

# ⏹案例来源
# https://wangdoc.com/bash/script#getopts-%E5%91%BD%E4%BB%A4

# ---------------------------------------------------------------------------------------------------
# ⏹getopts 命令作用
# getopts命令用在脚本内部，可以解析复杂的脚本命令行参数，
# 通常与while循环一起使用，取出脚本所有的带有前置连词线（-）的参数。
#
# ⏹语法
# getopts optstring name
#     参数1: optstring
#            是一个字符串，给出脚本所有的连词线参数。
#            若某个脚本可以有三个配置项参数-l、-h、-a，其中只有-a可以带有参数值，而-l和-h是开关参数，
#            那么getopts的第一个参数写成 lha: ，顺序不重要。
#            a后面有一个冒号，表示该参数带有参数值，getopts规定带有参数值的配置项参数，后面必须带有一个冒号
#     参数2: name
#            是一个变量名，用来保存当前取到的配置项参数
# ---------------------------------------------------------------------------------------------------

# 🔴脚本正常调用
# /usr/bin/env bash "e:\My_Project\BashStudy\05-脚本\04-getopts命令.sh" -l -h -a user_110 address hobby

# 🔴脚本异常调用（脚本并没有设置 -w 配置项）
# /usr/bin/env bash "e:\My_Project\BashStudy\05-脚本\04-getopts命令.sh" -l -h -a user_110 -w

# ----------------------------------------------------------------------------
# ⏹getopts 'lha:' OPTION;
# 'lha:'
#     连线词参数，-a配置项后面因为有参数值，所以添加了冒号 :  
#                -l 和 -h 因为是 开关参数，所以后面没有冒号
# $OPTION
#     当前读取到的连线词参数
#
# $OPTARG
#     某个连线词参数有值的话，环境变量 $OPTARG 保存的就是 参数值
# ----------------------------------------------------------------------------
while getopts 'lha:' OPTION; do
    case "$OPTION" in
        l)
            echo "linuxconfig"
            ;;
        h)
            echo "h stands for h"
            ;;
        a)
            # 获取出a配置参数所对应的参数值
            a_param_value="$OPTARG"
            echo "a配置项所对应的变量值为: $OPTARG"
            ;;
        ?)
            # 如果有 -l -h -a 之外的 带连线词的配置项的话，就会进入此处
            echo "script usage: $(basename "$0") [-l] [-h] [-a somevalue]" >&2
            # 退出脚本执行
            exit 1
            ;;
    esac
done

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

echo "$OPTIND"
echo "全部的参数为: " "$@"

# ---------------------------------------------------------------------------------------------------
# ⏹变量$OPTIND在getopts开始执行前是1，然后每次执行就会加1。
# 等到退出while循环，就意味着连词线参数全部处理完毕。
# 这时，$OPTIND - 1就是已经处理的连词线参数个数，
# 使用shift命令将这些参数移除，保证后面的代码可以用$1、$2等处理命令的主参数。
# ---------------------------------------------------------------------------------------------------
# "$(($OPTIND - 1))" 虽然也可以，但是 $OPTIND 中的 $ 可以不加，所以更推荐下面这种写法
shift "$((OPTIND - 1))"

echo '-------------------------------'
echo "全部的参数为: " "$@"
echo '-------------------------------'

echo "a参数对应的变量为: ${a_param_value}"

# /usr/bin/env bash "e:\My_Project\BashStudy\05-脚本\04-getopts命令.sh" -l -h user_110 -a address hobby
# ---------------------------------------------------------------------------------------------------
# ⏹只要遇到不带连词线的参数，getopts就会执行失败，从而退出while循环。
# getopts可以解析 
#               -l -h -a user_110 address hobby
# 但是在解析
#               -l -h user_110 -a address hobby
# 时，解析到 -l -h user_110 之后，
# 就会退出 while 循环
# ---------------------------------------------------------------------------------------------------
