#!/usr/bin/env bash

# ---------------------------------------------------------------------------------------------------
# ⏹source命令用于执行一个脚本
# 1. 可用于重新加载一个配置文件
# 2. 在脚本内部加载外部的库
#
# ⏹在当前Shell执行脚本时，不会像直接执行脚本时，会新建一个子Shell
# 所以通过 source 命令执行脚本时，不需要export变量。
# ---------------------------------------------------------------------------------------------------

# 切换到当前的目录
cd 05-脚本 || exit

# shellcheck disable=SC2034
# 只是定义了该变量，并没用使用 export 命令将其导出到环境变量中
var1='[08-source命令.sh]中定义的变量'

# shellcheck disable=SC1091
# ------------------------------------------------------------------------------------
# 🔴由于通过 source 命令执行脚本并不会新建子Shell，
# 所以对于 08-z_1_test.sh 脚本而言，和 08-source命令.sh 用的是同一个 Shell
# 所以即使没有通过 export 命令来导出var1变量到环境变量
# 08-z_1_test.sh 脚本中也可以获取到 08-source命令.sh 定义的变量
# ------------------------------------------------------------------------------------
source ./08-z_1_test.sh

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# ------------------------------------------------------------------------------------
# 🔴通过 bash 命令执行的脚本，会新创建一个shell，
# 并且 var1 变量没有通过export命令添加到环境变量中，
# 所以此时无法在 ./08-z_1_test.sh 中获取 08-source命令.sh 创建的变量
# ------------------------------------------------------------------------------------
bash ./08-z_1_test.sh

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# shellcheck disable=SC1091
# ------------------------------------------------------------------------------------
# 🔴定义函数库： 可以将常用的函数放在一个脚本文件中
# 通过 source 命令引入到其他脚本中，避免重复代码。
# 08-z_2_tool.sh 中有工具函数，相当于通过 source 命令在当前脚本中加载外部库
# ------------------------------------------------------------------------------------
source ./08-z_2_tool.sh

print_user_info 参数2

# shellcheck disable=SC1091
# ------------------------------------------------------------------------------------
# 🔴加载环境变量或配置文件： source 常用于加载包含环境变量或配置的文件。
# 当有一个包含环境变量的文件 config.sh 时，可以使用 source 命令加载它
# ------------------------------------------------------------------------------------
# ⏹source有一个简写形式，可以使用一个点 . 来表示。
. ./08-z_3_config.sh

echo "Database host: $DB_HOST"
echo "Database user: $DB_USER"

# ------------------------------------------------------------------------------------
# 🔴更新当前 shell 环境： 
# 修改环境变量后，可以通过 source ~/.bashrc 立即应用这些更改，而无需重新启动 shell
# ------------------------------------------------------------------------------------