#!/usr/bin/env bash

# ----------------------------------------------------------------------------------------------------
# ⏹-E选项
# 1. 一旦设置了-e参数，会导致函数内的错误不会被trap命令捕获
# 2. -E参数可以纠正这个行为，使得函数也能继承trap命令。
# ----------------------------------------------------------------------------------------------------
# 使用了 -e，导致致函数内的错误不会被trap命令捕获
# 为了函数内的错误会被trap命令捕获住，我们使用 -E 选项开启 trap命令捕获
set -Eeuo pipefail

# trap 注册了 ERR 处理程序,当函数执行失败时，trap 捕获到 ERR 信号，执行echo彩色信息输出
trap "echo -e '\e[1;31mERR信号被捕获,错误消息打印...\e[0m'" ERR

my_func() {
    # 尝试执行一个不存在的命令
    not_exit_command
}

# 调用函数，由于函数内尝试调用不存在的命令，因此会报错
my_func