#!/usr/bin/env bash

# --------------------------------------------------
# ⏹创建数组
# --------------------------------------------------
# 创建一个空数组
arr1=()
declare -a arr2

# shellcheck disable=SC2128
# 没有赋值的数组元素默认是空字符串
if [[ -z "$arr2" ]]; then
    echo 'arr2是一个空数组'
fi

# 通过一次性赋值的方式创建数组
arr3=('香蕉' '苹果' '橘子')
# 使用declare命令的方式初始化一个数组
declare -a arr4=('地球' '月球' '火 星' 金星)

cd 08-循环 || exit
# 通过通配符创建数组
arr5=( *.sh )
arr6=( {1..5} )

# --------------------------------------------------
# ⏹元素添加
# --------------------------------------------------
# 向数组的末尾添加元素
arr1+=('中国' '日本' '韩国')

# 通过下标的方式向数组中添加元素
arr4[3]='菠 萝'
arr6+=( {6..8}_num )

# --------------------------------------------------
# ⏹数组读取
# --------------------------------------------------
# 读取数组的第一个元素
echo "${arr3[0]}"
# 读取数组的所有元素
echo "${arr5[@]}"
echo "${arr6[@]}"

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# -------------------------------------------------------------------
# ⏹数组遍历
# -------------------------------------------------------------------
# shellcheck disable=SC2068
# ❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌
# ⚠️错误的遍历方式⚠️
#   由于 ${arr4[@]} 没有放到双引号之内
#   导入含有空格的元素被错误的拆分开
# ❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌
for ele in ${arr4[@]}; do
  echo "$ele"
done
# 地球
# 月球
# 火
# 星
# 菠
# 萝

# 🔴正确的遍历方式，"${arr4[@]}" 要放在引号内，避免元素中内含空格的问题
for ele in "${arr4[@]}"; do
  echo "$ele"
done
# 地球
# 月球
# 火 星
# 菠 萝

# ⏹${数组[*]} 会将整个数组合并为衣蛾字符串(由 IFS 变量分隔)
echo "${arr3[*]}"

