#!/usr/bin/env bash

# --------------------------------------------------------------------------------
# ⏹~ 
# 自动扩展成当前用户的主目录
# --------------------------------------------------------------------------------
echo ~  # /c/Users/admin
# ~+会扩展成当前所在的目录，相当于 pwd 命令。
echo ~+  # /e/My_Project/BashStudy
pwd  # /e/My_Project/BashStudy

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# --------------------------------------------------------------------------------
# ⏹?
# 代表文件路径里面的任意单个字符，不包括空字符。
# --------------------------------------------------------------------------------

ls "./02-模式扩展/file1" 
# a.txt
# ab.txt
# abc.txt
# b.txt
# sub

# 🔴使用?匹配单个字符
ls ./02-模式扩展/file1/?.txt
# ./02-模式扩展/file1/a.txt
# ./02-模式扩展/file1/b.txt

# 🔴使用???匹配3个字符
ls ./02-模式扩展/file1/???.txt # ./02-模式扩展/file/abc.txt

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# --------------------------------------------------------------------------------
# ⏹*
# *字符代表文件路径里面的任意数量的任意字符，包括零个字符。
# --------------------------------------------------------------------------------

# -maxdepth 1 只搜索当前目录，不搜索子目录
# *.txt 搜索所有以txt结尾的文件
find ./02-模式扩展/file1/ -maxdepth 1 -name "*.txt"
# ./02-模式扩展/file1/.a.txt
# ./02-模式扩展/file1/a.txt
# ./02-模式扩展/file1/ab.txt
# ./02-模式扩展/file1/abc.txt
# ./02-模式扩展/file1/b.txt