#!/usr/bin/env bash

# --------------------------------------------------------------------------------
# ⏹[ ]
# 方括号扩展的形式是[...]，只有文件确实存在的前提下才会扩展。
# 如果文件不存在，就会原样输出。
# --------------------------------------------------------------------------------

# a.txt 和 b.txt 本身就存在，所以会扩展成功
echo ./02-模式扩展/file2/[ab].txt
# ./02-模式扩展/file2/a.txt 
# ./02-模式扩展/file2/b.txt

# 因为 d.txt 和 e.txt 不存在，所以会原样输出，不会扩展成功
echo ./02-模式扩展/file2/[de].txt
# ./02-模式扩展/file2/[de].txt

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# --------------------------------------------------------------------------------
# ⏹[^...]
# ⏹[!...]
# 匹配不在方括号里面的字符
# --------------------------------------------------------------------------------

# 🔴下面两种写法都匹配不以 a b c 开头的文件
echo ./02-模式扩展/file2/[^abc].txt
echo ./02-模式扩展/file2/[!abc].txt
# ./02-模式扩展/file2/v.txt 
# ./02-模式扩展/file2/w.txt

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

# --------------------------------------------------------------------------------
# ⏹方括号扩展有一个简写形式[start-end]，表示匹配一个连续的范围。
# [a-z]：所有小写字母。
# [a-zA-Z]：所有小写字母与大写字母。
# [a-zA-Z0-9]：所有小写字母、大写字母与数字。
# [abc]*：所有以a、b、c字符之一开头的文件名。
# program.[co]：文件program.c与文件program.o。
# BACKUP.[0-9][0-9][0-9]：所有以BACKUP.开头，后面是三个数字的文件名。
# 
# ⏹否定形式 [!start-end]，匹配不属于这个范围的字符。
# 比如，[!a-zA-Z]表示匹配非英文字母的字符。
# --------------------------------------------------------------------------------

# 🔴[a-c] 表示从a到c
echo ./02-模式扩展/file2/[a-c].txt
# ./02-模式扩展/file2/a.txt
# ./02-模式扩展/file2/b.txt 
# ./02-模式扩展/file2/c.txt

# 🔴[!a-c] 表示除a到c之外的所有文件
echo ./02-模式扩展/file2/[!a-c].txt
# ./02-模式扩展/file2/v.txt 
# ./02-模式扩展/file2/w.txt